# Используем легковесный базовый образ Python
FROM python:3.12-slim

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Устанавливаем переменную окружения для отключения буферизации вывода Python
ENV PYTHONUNBUFFERED=1

# Копируем файл с зависимостями и устанавливаем их
# Этот шаг кэшируется и будет выполняться заново только при изменении requirements.txt
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# Копируем исходный код приложения
COPY ./app ./app

# Сообщаем Docker, что контейнер будет слушать порт 8000
EXPOSE 8000

# Команда для запуска приложения при старте контейнера
CMD ["uvicorn", "app.main:app", "--host", "0.0.0.0", "--port", "8000"]